qemu-user-targets/CVE-2015-2051/WICHR/unittests-WICHR/fuzz_campaign_status.json

[{"trial_start": "2021_05_01_15_22", "trial_complete": false, "targets": [{"target_path": "\"http://purenetworks.com/HNAP1/GetDeviceSettings\"", "requests": ["POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetDeviceSettings xmlns=\"http://purenetworks.com/HNAP1/\" /></soap:Body></soap:Envelope>"], "methods": {"POST": 1}, "is_soapaction": true, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "http://172.17.0.15/hnap/GetOperationMode.xml?v=20150211171738", "requests": ["GET http://172.17.0.15/hnap/GetOperationMode.xml?v=20150211171738 "], "methods": {"GET": 1}, "is_soapaction": false, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "http://172.17.0.15/hnap/GetDeviceFeatureAlpha.xml?v=20150211171738", "requests": ["GET http://172.17.0.15/hnap/GetDeviceFeatureAlpha.xml?v=20150211171738 "], "methods": {"GET": 1}, "is_soapaction": false, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "\"http://purenetworks.com/HNAP1/GetWanSettings\"", "requests": ["POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWanSettings xmlns=\"http://purenetworks.com/HNAP1/\" /></soap:Body></soap:Envelope>"], "methods": {"POST": 1}, "is_soapaction": true, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "http://172.17.0.15/hnap/GetUSBStorageDevice.xml?v=20150211171738", "requests": ["GET http://172.17.0.15/hnap/GetUSBStorageDevice.xml?v=20150211171738 "], "methods": {"GET": 1}, "is_soapaction": false, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "\"http://purenetworks.com/HNAP1/GetClientInfo\"", "requests": ["POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetClientInfo xmlns=\"http://purenetworks.com/HNAP1/\" /></soap:Body></soap:Envelope>"], "methods": {"POST": 1}, "is_soapaction": true, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "http://172.17.0.15/hnap/GetScheduleSettings.xml?v=20150211171738", "requests": ["GET http://172.17.0.15/hnap/GetScheduleSettings.xml?v=20150211171738 "], "methods": {"GET": 1}, "is_soapaction": false, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "\"http://purenetworks.com/HNAP1/GetRouterLanSettings\"", "requests": ["POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetRouterLanSettings xmlns=\"http://purenetworks.com/HNAP1/\" /></soap:Body></soap:Envelope>"], "methods": {"POST": 1}, "is_soapaction": true, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "\"http://purenetworks.com/HNAP1/GetSmartconnectSettings\"", "requests": ["POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetSmartconnectSettings xmlns=\"http://purenetworks.com/HNAP1/\" /></soap:Body></soap:Envelope>"], "methods": {"POST": 1}, "is_soapaction": true, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "\"http://purenetworks.com/HNAP1/GetIPv6Status\"", "requests": ["POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetIPv6Status xmlns=\"http://purenetworks.com/HNAP1/\" /></soap:Body></soap:Envelope>"], "methods": {"POST": 1}, "is_soapaction": true, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "\"http://purenetworks.com/HNAP1/GetWanStatus\"", "requests": ["POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWanStatus xmlns=\"http://purenetworks.com/HNAP1/\" /></soap:Body></soap:Envelope>"], "methods": {"POST": 1}, "is_soapaction": true, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "\"http://purenetworks.com/HNAP1/GetWLanRadioSettings\"", "requests": ["POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSettings xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_2.4GHz</RadioID></GetWLanRadioSettings></soap:Body></soap:Envelope>", "POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSettings xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_2.4GHz_Guest</RadioID></GetWLanRadioSettings></soap:Body></soap:Envelope>", "POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSettings xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_5GHz</RadioID></GetWLanRadioSettings></soap:Body></soap:Envelope>", "POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSettings xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_5GHz_Guest</RadioID></GetWLanRadioSettings></soap:Body></soap:Envelope>", "POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSettings xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_5GHz_2</RadioID></GetWLanRadioSettings></soap:Body></soap:Envelope>", "POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSettings xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_5GHz_2_Guest</RadioID></GetWLanRadioSettings></soap:Body></soap:Envelope>"], "methods": {"POST": 6}, "is_soapaction": true, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "\"http://purenetworks.com/HNAP1/GetWLanRadioSecurity\"", "requests": ["POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSecurity xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_2.4GHz</RadioID></GetWLanRadioSecurity></soap:Body></soap:Envelope>", "POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSecurity xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_2.4GHz_Guest</RadioID></GetWLanRadioSecurity></soap:Body></soap:Envelope>", "POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSecurity xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_5GHz</RadioID></GetWLanRadioSecurity></soap:Body></soap:Envelope>", "POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSecurity xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_5GHz_Guest</RadioID></GetWLanRadioSecurity></soap:Body></soap:Envelope>", "POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSecurity xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_5GHz_2</RadioID></GetWLanRadioSecurity></soap:Body></soap:Envelope>", "POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetWLanRadioSecurity xmlns=\"http://purenetworks.com/HNAP1/\"><RadioID>RADIO_5GHz_2_Guest</RadioID></GetWLanRadioSecurity></soap:Body></soap:Envelope>"], "methods": {"POST": 6}, "is_soapaction": true, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "http://172.17.0.15/hnap/GetMultipleHNAPs.xml?v=20150211171738", "requests": ["GET http://172.17.0.15/hnap/GetMultipleHNAPs.xml?v=20150211171738 "], "methods": {"GET": 1}, "is_soapaction": false, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "http://172.17.0.15/GuestZone.html", "requests": ["POST http://172.17.0.15/GuestZone.html =Submit&status_gz_smartconnect=on&wifiName_smartconnect=&password_smartconnect=&status_gz_24=on&wifiName_24g=&password_24g=&status_gz_5=on&wifiName_5g=&password_5g=&status_gz_5hi=on&wifiName_5g_hi=&password_5g_hi=&internetAccessOnly=on&="], "methods": {"POST": 1}, "is_soapaction": false, "last_completed_trial": 0, "last_completed_refuzz": 0}, {"target_path": "http://172.17.0.15/js/CheckConnection?_=1619637968306", "requests": ["GET http://172.17.0.15/js/CheckConnection?_=1619637968306 "], "methods": {"GET": 1}, "is_soapaction": false, "last_completed_trial": 0, "last_completed_refuzz": 0}]}]